; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	infrared2 - mode
	infrared4 - mode
	image5 - mode
	infrared6 - mode
	thermograph1 - mode
	infrared3 - mode
	thermograph0 - mode
	Star2 - direction
	Star3 - direction
	Star5 - direction
	GroundStation1 - direction
	Star4 - direction
	Star0 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared6)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 infrared3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star4)
	(supports instrument2 image5)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared4)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument3 infrared4)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet13)
)
(:goal (and
	(pointing satellite0 Star6)
	(pointing satellite1 Planet7)
	(have_image Star6 infrared4)
	(have_image Star6 infrared6)
	(have_image Planet7 infrared3)
	(have_image Planet7 image5)
	(have_image Star8 thermograph0)
	(have_image Star8 infrared3)
	(have_image Star9 infrared6)
	(have_image Star9 thermograph0)
	(have_image Phenomenon10 infrared3)
	(have_image Phenomenon10 image5)
	(have_image Planet11 image5)
	(have_image Star12 infrared2)
	(have_image Star12 thermograph0)
	(have_image Planet13 infrared3)
))

)

; plan
1. (turn_to satellite0 groundstation1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 16
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 16
3. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 16
4. (turn_to satellite0 star12 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star12)
   goals met: 0 of 16
5. (take_image satellite0 star12 instrument1 infrared2)
   added: (have_image star12 infrared2)
   goals met: 1 of 16
6. (turn_to satellite0 planet13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet13)
   goals met: 1 of 16
7. (take_image satellite0 planet13 instrument1 infrared3)
   added: (have_image planet13 infrared3)
   goals met: 2 of 16
8. (turn_to satellite0 phenomenon10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 16
9. (take_image satellite0 phenomenon10 instrument1 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 3 of 16
10. (turn_to satellite0 groundstation1 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation1)
   goals met: 3 of 16
11. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 16
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 16
13. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 3 of 16
14. (turn_to satellite0 planet7 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet7)
   goals met: 3 of 16
15. (take_image satellite0 planet7 instrument0 infrared3)
   added: (have_image planet7 infrared3)
   goals met: 4 of 16
16. (turn_to satellite0 star6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star6)
   goals met: 5 of 16
17. (take_image satellite0 star6 instrument0 infrared6)
   added: (have_image star6 infrared6)
   goals met: 6 of 16
18. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 5 of 16
19. (take_image satellite0 star8 instrument0 infrared3)
   added: (have_image star8 infrared3)
   goals met: 6 of 16
20. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 6 of 16
21. (take_image satellite0 star9 instrument0 infrared6)
   added: (have_image star9 infrared6)
   goals met: 7 of 16
22. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 7 of 16
23. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 7 of 16
24. (turn_to satellite0 groundstation1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation1)
   goals met: 7 of 16
25. (calibrate satellite0 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 7 of 16
26. (turn_to satellite0 phenomenon10 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon10)
   goals met: 7 of 16
27. (take_image satellite0 phenomenon10 instrument2 image5)
   added: (have_image phenomenon10 image5)
   goals met: 8 of 16
28. (turn_to satellite0 planet11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet11)
   goals met: 8 of 16
29. (take_image satellite0 planet11 instrument2 image5)
   added: (have_image planet11 image5)
   goals met: 9 of 16
30. (turn_to satellite0 planet7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet7)
   goals met: 9 of 16
31. (take_image satellite0 planet7 instrument2 image5)
   added: (have_image planet7 image5)
   goals met: 10 of 16
32. (turn_to satellite0 star12 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star12)
   goals met: 10 of 16
33. (take_image satellite0 star12 instrument2 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 11 of 16
34. (turn_to satellite0 star8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star8)
   goals met: 11 of 16
35. (take_image satellite0 star8 instrument2 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 12 of 16
36. (turn_to satellite0 star9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star9)
   goals met: 12 of 16
37. (take_image satellite0 star9 instrument2 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 13 of 16
38. (turn_to satellite0 star6 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star6)
   goals met: 14 of 16
39. (take_image satellite0 star6 instrument2 infrared4)
   added: (have_image star6 infrared4)
   goals met: 15 of 16
40. (turn_to satellite1 planet7 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet7)
   goals met: 16 of 16
